STRINGS = {
    1: """🎇 **- شكراً لتنصيبك سورس سيدثون **
•• من الاسفل بعض الخيارات التي ستساعدك في سيدثون.""",
    2: """🎉** حول سيدثون**
🧿 سيدثون هو يوزربوت في مكتبة التيليثون تم صنعه بأستخدام البايثون. يحتوي على اكثر من 100 أمر تساعدك في التليجرام و جمثون هو افضل سورس من ناحية الامان.
❣ قناة السورس **@E9N99**""",
    3: """**💡• قنوات السورس •**
قناة الكلايش:  @clccca
قناة الملاحظات: @X_X_X_X_R
قناة السورس: @E9N99
قناة المساعدة: @E9N99
مجموعة المساعدة: @TIPTHON_HELP""",
    4: f"""• `لمعرفة جميع اوامر السورس ارسل`
  - `.اوامري`
  - `.الاوامر`""",
    5: """• **لأي مساعدة ثانية **
  - أنضم في مجموعة المساعدة **@TIPTHON_HELP**.
• شكرا لك لقرائتك هذه المقالة.""",
}
