import re

from telethon import Button, events
from telethon.events import CallbackQuery

from l313l.razan.resources.assistant import *
from l313l.razan.resources.mybot import *
from SedUb import l313l
from ..core import check_owner
from ..Config import Config

JEP_IC = "https://telegra.ph/file/45a08298c226a89563e4d.mp4"
ROE = "**♰ هـذه هي قائمة اوامـر سـورس سيدثون ♰**"

if Config.TG_BOT_USERNAME is not None and tgbot is not None:

    @tgbot.on(events.InlineQuery)
    async def inline_handler(event):
        builder = event.builder
        result = None
        query = event.text
        await bot.get_me()
        if query.startswith("اوامري") and event.query.user_id == bot.uid:
            buttons = [
                [Button.inline("( اوامر الادمن  ) ① ", data="Admin")],
                
                    [Button.inline("( المجموعات ) ②", data="Groups"),
                    Button.inline("( الترحيب .. ) ③", data="Tarh"),
                    Button.inline("( الحمايه .. ) ④", data="Securty")],
                    
                    [Button.inline("( الانتحال والتقليد ) ⑤", data="TargetU")],[Button.inline("( التحميل ..) ⑥", data="DOO")],
                    
                [Button.inline("( المنع .. ) ⑦", data="NOT"),
                    Button.inline("( التنظيف .. ) ⑧", data="Clear")],
                    [Button.inline("( الفارات ) ⑨", data="Var")],
                [Button.inline("( الوقتي ..) ⓪①", data="Timer"),
                    Button.inline("( الكشف و ..) ①① )", data="OPN")],
                [Button.inline("( المساعده ) ②① ", data="Helper")],
              [Button.inline("( أذكار .. ) ③①", data='Think'),
                    Button.inline("( الملصقات ) ④①", data="Sticker")],
                [Button.inline("( التسليه ميمز ) ⑤①", data="FunY")],
                [
                    Button.inline("( الصيغ ..) ⑥①", data="Contect"),
                    Button.inline(" ( التمبلر ..) ⑦①", data="Tumbler")],[Button.inline("(  الحساب ) ⑧①", data="Account")]
                    ,[Button.inline("( ميوزك ) ⑨①", data="Music"),Button.inline("( بصمات ) ⓪②", data="Voice")],[Button.inline("( التجميع ) ①②", data="Colect")]
                    ,[Button.url("( اوامر البوت )", url="veevvw.t.me")]
            ]
            if JEP_IC and JEP_IC.endswith((".jpg", ".png", "gif", "mp4")):
                result = builder.photo(
                    JEP_IC, text=ROE, buttons=buttons
                )
            elif JEP_IC:
                result = builder.document(
                    JEP_IC,
                    title="JoKeRUB",
                    text=ROE,
                    buttons=buttons,
                )
            else:
                result = builder.article(
                    title="JoKeRUB",
                    text=ROE,
                    buttons=buttons,
                )
            await event.answer([result] if result else None)

@l313l.tgbot.on(CallbackQuery)
@check_owner
async def _(event):
	if event.data == rb'JuSt':
		await event.answer('(•) قريبا ...',alert=True)
	elif event.data == rb'Control':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر التجميع
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .تجميع المليار )
- ( .تجميع الجوكر )
- ( .تجميع العقاب )
- ( .تجميع المليون )
- ( .تجميع العرب )
- ( .تجميع دعمكم )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Waad':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر وعد
★•┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .راتب وعد ) :
عند كتابة الأمر في المجموعة، يقوم البوت بتجميع الأموال كل ١٠ دقيقة.

- ( .ايقاف راتب وعد ) :
يستخدم لإيقاف امر تجميع الراتب من بوت وعد .

- ( .سرقة وعد + ايدي الشخص ) :
يستخدم لسرقة أموال شخص آخر كل ١٠ دقيقة بواسطة إرسال ايدي المستخدم مع الامر .

- ( .ايقاف سرقة وعد ) :
يستخدم لإيقاف امر سرقة الأموال من الآخرين.

- ( .بخشيش وعد ) :
يستخدم لإعطاء بخشيش لك كل ١٠ دقيقة في المجموعة.

- ( .ايقاف بخشيش وعد ) :
يستخدم لإيقاف امر اخذ بخشيش من بوت وعد.

- ( .استثمار وعد ) :
يستخدم لاستثمار أموالك مع كل ٢٠ دقيقة.

- ( .ايقاف استثمار وعد ) :
يستخدم لإيقاف عملية الاستثمار بأموالك.

★•┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Colect':
		Home = [[Button.inline('( اوامر التجميع )',data = 'Control'),Button.inline('( اوامر وعد )',data ='Waad')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر تجميع النقاط و بوت وعد :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر التجميع ) 
- ( .اوامر وعد ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Mems1':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة بصمات الميمز
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .تخوني )
- ( .مستمرة الكلاوات )
- ( .احب العراق )
- ( .احبك )
- ( .اخت التنيج )
- ( .اذا اكمشك )
- ( .اسكت )
- ( .افتهمنا )
- ( .اكل خرا )
- ( .العراق )
- ( .الكعده وياكم )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Mems2':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة بصمات الميمز
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .الكمر اني )
- ( .اللهم لا شماته )
- ( .اني مااكدر )
- ( .بقولك ايه )
- ( .تف على شرفك )
- ( .شجلبت )
- ( .شكد شفت ناس )
- ( .صباح القنادر )
- ( .ضحكة فيطية )
- ( .طار القلب )
- ( .غطيلي )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Mems3':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر بصمات الميمز
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .في منتصف الجبهة )
- ( .لاتقتل المتعه )
- ( .لا لتغلط )
- ( .لا يمه لا )
- ( .لحد يحجي وياي )
- ( .ماادري يعني )
- ( .منو انت )
- ( .مو صوجكم )
- ( .خوش تسولف )
- ( .يع )
- ( .زيج )
- ( .زيج2 )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Mems4':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر بصمات الميمز
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .يعني مااعرف )
- ( .يامرحبا )
- ( .منو انتة )
- ( .ماتستحي )
- ( .كعدت الديوث )
- ( .عيب )
- ( .عنعانم )
- ( .طبك مرض )
- ( .سييي )
- ( .سبيدر مان )
- ( .خاف حرام )
- ( .تحيه لاختك )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Mems5':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر بصمات الميمز
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .امشي كحبة )
- ( .امداك )
- ( .الحس )
- ( .افتهمنا )
- ( .اطلع برا )
- ( .اخت التنيج )
- ( .اوني تشان )
- ( .اوني تشان2 )
- ( .بجيت )
- ( .نشاقة )
- ( .لاتغلط )
- ( .احب الله )
- ( .روح )
- ( .خبز يابس )
- ( .خيار بصل )
- ( .ماي ارو )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Anmi':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الـخاص 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .الحماية تشغيل/تعطيل ) 
 لتشغيل امر الحمايه او تعطيله في الـخاص 

- ( .سماح ) 
 بالرد على الشخص للسماح له بالتكلم في الخاص

- ( .رفض ) 
 بالرد على الشخص لرفضه من الخاص 

- ( .المسموح لهم )
 فقط ارسل الامر لاظهار الاشخاص المسموح لهم والمرفوضين

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Voice':
		Home = [[Button.inline('( ميمز )',data='Mems1'),Button.inline('( ميمز 2 )',data='Mems2')],[Button.inline('( ميمز 3 )',data = 'Mems3'),Button.inline('( ميمز 4 )',data = 'Mems4')],[Button.inline('( ميمز 5 )',data = 'Mems5'),Button.inline('( انمي )',data='Anmi')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر بصمات الميمز :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .بصمات ميمز )
- ( .بصمات ميمز2 )
- ( .بصمات ميمز3 )
- ( .بصمات ميمز4 )
- ( .بصمات ميمز5 )
- ( .بصمات انمي ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Music':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الميوزك والتشغيل 🎵
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ اختر احدى هذه الاوامر
 ᯽︙ قبل أستخدام هذه الاوامر يجب تفعيل المود بكتابة ألامر ( .ميوزك تفعيل ) 
- ( .تشغيل_المكالمة )
- لتشغيل المحادثة الصوتيه
- ( .انهاء_المكالمة )
-لأنهاء المحادثه الصوتية 
- ( .دعوة )
- بالرد على الشخص لدعوته الى المكالمة 
- ( .معلومات_المكالمة )
- لعرض عنوان المكالمة وعدد لاشخاص الموجودين فيها 
- ( .تسمية_المكالمة )
- لتغير عنوان المكالمة 
- ( .انضمام )
- للأنضمام الى المحادثة الصوتية
- ( .مغادرة )
- لمغادرة المحادثة الصوتية 
- ( .تشغيل )
-بالرد على رابط اليوتيوب او كتابة الامر مع رابط ليوتيوب لتشغيل الاغنيه 
- ( .قائمة_التشغيل )
- لعرض قائمة التشغيل 
- ( .ايقاف_مؤقت )
 - لأيقاف الاغنية الحالية مؤقتا 
- ( .استمرار )
 -لأستمرار الاغنيه التي تم ايقافها 
- ( .تخطي )
- لتخطي الاغنيه وتشغيل الاغنيه الموجوده في قائمة التشغيل 

 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'TarFeh':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الترفيه
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .بلي )
- ( .كت )
- ( .خيروك )
- ( .غنيلي )
- ( .شعر )
- ( .قران )
- ( .البنك )
- ( .فلم )
- ( .ثيم )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Acnt':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الحساب والقنوات والمجموعات التي تديرها
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .معلوماتي ) 
( .قائمه قنواتي ) 
( .قائمه كروباتي )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Account':
		Home = [[Button.inline('( الترفيه )',data='TarFeh'),Button.inline('( الحساب )',data = 'Acnt')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الحساب و الترفيه :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الترفيه )
- ( .اوامر الحساب ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Zakr':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
˛ SedUb ، ٰFٓoٍَِNٌtSَ
•━═━═━═━═━━═━═━═━═━•
قائـمة اوامر الزغرفة :
 .زغرفة0
 .زغرفة1
 .زغرفة2
 .زغرفة3
 .زغرفة4
 .زغرفة5
 .زغرفة6
 .زغرفة7
 .زغرفة8
 .زغرفة9
 اكتب الاسم مع الامر للـزغرفة فقط انكليزي
•━═━═━═━═━━═━═━═━═━•‌‌
˛ SedUb ، ٰUٍsٓEِrBُoََt - CَِٓHُ
''', buttons=Home)
	elif event.data == rb'Tmplr':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامـر اسمـاء تمبـلر :
➖➖➖➖➖➖➖➖➖➖➖➖➖
 ᯽︙ اخـتر احـد هـذه القـوائـم:

- (.شباب1) 
- (.شباب2) 
- (.بنات1) 
- (.بنات2) 
- (.قنوات) 

➖➖➖➖➖➖➖➖➖➖➖➖➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'ArabicName':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
- ؏َـثمانَ 🍇.
- ؏ـمرَ  🍇.
- ؏َـلييہَ 🍇.
- مَحـمدد 🍇.
- تو‌୭ما 🍇.
┉ ┉ ┉ ┉ ┉
- ࢪزٱטּ 𝟐𝟎𝟐𝟏 🎄꙳.
- تــﯢت 𝟐𝟎𝟐𝟏 🎄꙳.
- شَيـטּ 𝟐𝟎𝟐𝟏 🎄꙳.
- نــﯢטּ 𝟐𝟎𝟐𝟏 🎄꙳.
- مَيممہَ 𝟐𝟎𝟐𝟏 🎄꙳.
- ݽيـטּ 𝟐𝟎𝟐𝟏 🎄꙳.
- دنــ‌ـو 𝟐𝟎𝟐𝟏 🎄꙳.
┉ ┉ ┉ ┉ ┉
- ࢪۅٛز 💕.
- ۿهـَدى 💕.
- سـَمــَࢪ 💕.
- جنـَاٺ 💕.
- مـَࢪيـَمٛہٰ 💕.
- ࢪقيـَۿـہ 💕.
- حَـﯛࢪا۽ِ 💕.
┉ ┉ ┉ ┉ ┉
- بَــنـۅشہ𓆤.
- ݛقَـﯡشہ𓆤.
- ﭑيَـﯡشہ𓆤.
- ࢪ࣪نَـشہ𓆤.
- سَݛﯠشہ𓆤.
- فَطـﯡشہ𓆤.
''', buttons=Home)
	elif event.data == rb'Months':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
-₁₉₉₀
-₁₉₉₁
-₁₉₉₂
-₁₉₉₃
-₁₉₉₄
-₁₉₉₅
-₁₉₉₆
-₁₉₉₇
-₁₉₉₈
-₁₉₉₉
-₂₀₀₀
-₂₀₀₁
-₂₀₀₂
-₂₀₀₃
-₂₀₀₄
-₂₀₀₅-
-₂₀₀₆
-₂₀₀₇
---
-𝒋𝒂𝒏𝒖𝒂𝒓𝒚.💞
-𝒇𝒆𝒃𝒓𝒖𝒂𝒓𝒚.💞
-𝒎𝒂𝒓𝒄𝒉.💞
𝒂𝒑𝒓𝒊𝒍.💞
-𝒎𝒂𝒚.💞
-𝒋𝒖𝒏𝒆.💞
-𝒋𝒖𝒍𝒚.💞
-𝒂𝒖𝒈𝒖𝒔𝒕 .💞
-𝒔𝒆𝒑𝒕𝒆𝒎𝒃𝒆𝒓 .💞
-𝒐𝒄𝒕𝒐𝒃𝒆𝒓.💞
-𝒏𝒐𝒗𝒆𝒎𝒃𝒆𝒓.💞\n-𝒅𝒆𝒄𝒆𝒎𝒃𝒆𝒓.💞
------
-𝐒𝐔𝐍𝐃𝐀𝐘.♡
-𝐌𝐎𝐍𝐃𝐀𝐘.♡
-𝐓𝐔𝐄𝐒𝐃𝐀𝐘.♡
-𝐖𝐄𝐃𝐍𝐄𝐒𝐃𝐀𝐘.♡
-𝐓𝐇𝐔𝐑𝐒𝐃𝐀𝐘.♡
-𝐅𝐑𝐈𝐃𝐀𝐘.♡
-𝐒𝐀𝐓𝐔𝐑𝐃𝐀𝐘.♡
''', buttons=Home)
	elif event.data == rb'Aktsarat':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامـر الاخـتصارات :
➖➖➖➖➖➖➖➖➖➖➖➖➖
 ᯽︙ اخـتر احـد هـذه القـوائـم:

 
- (.اختصارات1) 
- (.اختصارات2) 
- (.اختصارات3) 
- (.اختصارات4) 
- (.اختصارات5) 
➖➖➖➖➖➖➖➖➖➖➖➖➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Gif':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر المتـحركات :
➖➖➖➖➖➖➖➖➖➖➖➖➖
 ᯽︙ اختر احدى هذه القوائم

- ( .متحركات كيوت ) 
- ( .متحركات ساد )
➖➖➖➖➖➖➖➖➖➖➖➖➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Tumbler':
		Home = [[Button.inline('( الزغرفه )',data='Zakr'),Button.inline('( تمبلر )',data='Tmplr')],[Button.inline('( اسماء عربية )',data='ArabicName'),Button.inline('( اشهر مزغرفة )',data='Months')],[Button.inline('( الاختصارات )',data = 'Aktsarat'),Button.inline('( المتحركات )',data='Gif')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر التمبـلر :
➖➖➖➖➖➖➖➖➖➖➖➖➖
 ᯽︙ اختر احدى هذه القوائم

- ( .الزغرفة ) 
- ( .اسماء تمبلر )   
- (.اسماء عربية)
- ( .اشهر مزغرفة) 
- ( .الاختصارات ) 
- ( .البايو )
- (.المتحركات)

➖➖➖➖➖➖➖➖➖➖➖➖➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'ReP':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر تـحويل الصـيغ :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر

- ( .تحويل صورة )
 بالرد على الملصق لتحويله الى صورة

- ( .تحويل ملصق )
 بالرد على الصورة لتحويلها الى الملصق

- ( .تحويل voice )
بالرد على مقطع اغنية لتحويله على شكل بصمة صوتية

- ( .تحويل mp3 )
بالرد على البصمة الصوتية لتحويلها على شكل  مقطع mp3

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Contc':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الجهات والاضافة
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .ضيف +  رابط مجموعة )
  يستخدم الامر لاخذ اعضاء من مجموعة ثانية واضافتهم في مجموعتك ترسل الامر مع اربط قروب عام في مجموعتك للاضافة 
 مثال :  .ضيف https://t.me/sedthon_help 

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Contect':
		Home = [[Button.inline('( التحويل )',data='ReP'),Button.inline('( الجهات )',data='Cntc')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر تحويل الصيغ و الجهات :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر التحويل )
- ( .اوامر الجهات ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Tslia':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر التسلية :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
 ᯽︙ اختر احدى هذه القوائم

- ( .تسلية 1 )
- ( .تسلية 2 )
- ( .تسلية 3 ) 
- ( .تسلية 4 )
- ( .تسلية 5 )
- ( .تسلية 6 )
- ( .تسلية 7 )
- ( .تسلية 8 ) 
- ( .فيك typing 300 ) 
- ( .رفع ادمن )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data ==rb'Tahshesh':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر التحشيش :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
 ᯽︙ اختر احدى هذه القوائم

جميع اوامـر التحشيش تستخـدم بالـرد عـلى الشخص

- ( .رفع تاج )
- ( .رفع بكلبي )
- ( .رفع مطي )
- ( .رفع جلب ) 
- ( .رفع قرد )
- ( .رفع مرتي )
- ( .رفع زوجي )
- ( .نسبة الانوثة )
- ( .نسبة الحب )
- ( .نسبة الغباء ) 
- ( .رفع زاحف ) 
- ( .رفع كحبة ) 
- ( .رفع فرخ ) 
- ( .رزله ) 
- ( .رفع صاك ) 
- ( .رفع حاته ) 
- ( .رفع بقره ) 
- ( .رفع ايجة )
- ( .رفع زبال )
- ( .رفع كواد )
- ( .رفع ديوث )
- ( .رفع مجنب )
- ( .رفع مميز )
- ( .رفع ادمن )
- ( .رفع منشئ )
- ( .رفع مالك )
- ( .رفع وصخ )
- ( .نسبة الكذب )
- ( .نسبة الدياثه )
- ( .نسبة الشذوذ )
- ( .نسبة الجمال )
- ( .نسبة الخيانه )

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Mems':
		pass
	elif event.data == rb'FunY':
		Home = [[Button.inline('( التسليه )',data='Tslia'),Button.inline('( التحشيش )',data='Tahshesh')],[Button.inline('( الميمز )',data='Mems')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر التسلية والتحشيش :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر التسلية )
- ( .اوامر التحشيش )
- ( .اوامر الميمز )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Stkr':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الملصقـات
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر

- ( .ملصق )
بالرد على الملصق لأخذه و عمل حزمه خاصة بك و اضافته بها

- ( .حزمة )
بالرد على الملصق لنسخ الحزمة كاملة بداخل حزمة ملصقاتك الخاصة

- (.معلومات_الملصق )
بالرد على الملصق لعرض معلومات الحزمة

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data ==rb'Gogle':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر كوكل :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .صور +  عدد الصور + نص )
للحصول على صور من متصفح كوكل بكتابة الامر وعدد الصور الحد 10 واسم النص 

- ( .استخرج + عربي ) 
 لاستخراج النصوص من الصور التي تحتوي على كلمات عربيه

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Sticker':
		Home = [[Button.inline('( الملصقات )',data='Stkr'),Button.inline('( كوكل )',data='Gogle')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الملصقات وكوكل :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الملصقات )
- ( .اوامر كوكل )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Thatia':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح امر الصورة الذاتية :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .ذاتية )
 بالـرد عـلى الصـورة ذاتيـة الـتدمير ليـقوم بـحفظها وارسالـها لك فـي الرسائل الـمحفوظة بسرية وبـدون عـلم الـطرف الأخر 
- ( .حفظ )
 بالـرد عـلى الصـورة الموجوده في المجموعة ذات التقييد المحتوى ليـقوم بـحفظها وارسالـها لك فـي الرسائل الـمحفوظة بسرية وبـدون عـلم الـطرف الأخر
( .الذاتية تشغيل )
 قم بكتابة الامر في أي مكان ليقوم بتفعيل الامر وحفظ الصور الذاتية التدمير تلقائياً
( .الذاتية تعطيل )
 قم بكتابة الامر في مكان لتقوم بتعطيل الامر الصورة الذاتية التدمير

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Hy':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر التحذيرات :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .تحذير + السبب )
بالرد على الشخص ليقوم بتحذيره يمكنك وضع سبب كذلك

- ( .التحذيرات )
بالرد على الشخص ليقوم باظهار تحذيراته.

- ( .حذف التحذيرات )
بالرد على الشخص لحذف تحذيراته.

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'List':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر اللستة :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .لستة )
يقوم بصنع لستة شفافة لمنشور معين
شـرح الامـر  : 
 https://t.me/VEEVVW

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Owner':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الملكية :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .ملكية )
يقوم بكتابة التمر في القناة التي تريد تحويلها لشخص و بكتابة الامر مع معرف الشخص

 لاستخدام امر نقل الملكية تحتاج لوضع TG_2STEP_VERIFICATION_CODE و معه رمز حسابك في الفارات 

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'SlP':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر السليب :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .سليب + السبب)
يقوم بادخالك في وضع غير المتصل يقوم بالرد على اي شخص برسالة يقول فيها انك غير متواجد.
- مثـال : .سليب نايم

- ( .سليب_ميديا + السبب )
يقوم بنفس وظيفة الامر العادي غير انه يمكنك ارفاق صورة او متحركة بالرد عليها مع الامر.

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Athker':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الاذكار :
➖➖➖➖➖➖➖➖➖➖➖➖➖
 ᯽︙ اختر احدى هذه القوائم

- ( .اذكار الصباح ) 
- ( .اذكار المساء )   
- (.اذكار النوم)
- ( .اذكار الصلاة) 
- ( .اذكار الاستيقاظ ) 
- ( .احاديث )
- ( .اذكار )
- ( .اذكار عشر )

➖➖➖➖➖➖➖➖➖➖➖➖➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Think':
		Home = [[Button.inline('( الصورة الذاتية )',data='Thatia'),Button.inline('( التحذيرات )',data='Hy')],[Button.inline('( اللتسة )',data='List'),Button.inline('( الملكية )',data='Owner')],[Button.inline('( السليب )',data='SlP'),Button.inline('( الاذكار )',data='Athker')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الارسال :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .امر الصورة الذاتية )
- ( .اوامر التحذيرات )
- ( .اوامر اللستة )
- ( .اوامر الملكية ) 
- ( .اوامر السليب ) 
- ( .اوامر الاذكار )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'DateTim':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الوقت والتاريخ :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .تاريخ )
بالرد على الشخص او كتابة معرفه مع الامر لعرض سجل اسماء حسابه.

- ( .الوقت )
لعرض الوقت على شكل ملصق

- ( .وقت )
لعرض الوقت على شكل كتابة

- ( .مؤقت + الوقت + النص )
يقوم بإرسال رسالة مؤقتة و حذفها بعد وقت معين
- مثـال : .مؤقت 5 الجوكر

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Corona':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر كورونا :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
 ᯽︙ اختر احدى هذه الاوامر

- ( .كورونا + الدولة )
للحصول على احصائيات فايروس كورونا
- مثـال : .كورونا Morocco

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)

	elif event.data == rb'Slah':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الصلاة :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .صلاة )
اكتب الامر مع اسم محافظتك باللغه الانكليزية للحصول على اوقات الصلاة

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'HeLr':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر المساعدة :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .موقع + المكان )
للحصول على مكان في الخريطه و ارساله لك

- ( .جد بكج + اسم البكج )
لمعرفة هل ان البكج او المكتبة موجود ام لا/n/n- ( .صورة )
بالرد على الشخص للحصول على صورة حسابه الشخصية.

- ( .صوره كلها )
للرد على الشخص للحصول على صور حسابه الشخصية كلها.

- ( .سرعة النت )
ارسل الامر لقياس سرعة الانترنت

- ( .حساب )
كتابة الامر مع معادلة رياضية و سيقوم بحلها و ارسالها لك

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)

	elif event.data == rb'PostoAll':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الـتوجيه والأذاعـة :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .وجه + نص )
لعمـل اذاعـة للـنص في المجـموعـات اكتب الامر ونـصـك

- ( .حول + نص )
لعمـل اذاعـة للـنص للـ الدردشـات الخـاصة اكتب الامر ونـصـك

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Helper':
		Home = [[Button.inline('( الوقت والتاريخ )',data='DateTim'),Button.inline('( كورونا )',data='Corona')],[Button.inline('( الصلاة )',data='Slah'),Button.inline('( مساعدة )',data='HeLr')],[Button.inline('( الاذاعه )',data='PostoAll')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر المساعدة  :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الوقت والتاريخ )
- ( .اوامر كورونا )
- ( .اوامر الصلاة ) 
- ( .اوامر مساعدة )
- ( .اوامر الاذاعه ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'KshF':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الكشف :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .الايدي )
بالرد على الشخص او كتابة معرفه مع الامر لعرض معلوماته.

- ( .ايدي )
بالرد على الشخص لعرض معلوماته

- ( .كشف )
بالرد على الشخص لعرض معلوماته بشكل مبسط

- ( .رابط الحساب )
يالرد على الشخص للحصول على رابط حساب الشخص

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Link':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الروابط :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .دنس + الرابط )
لكشف نظام دومين موقع معين اكتب الامر مع الرابط

- ( .مصغر )
بالرد على الرابط او وضع الرابط مع الامر ليقوم بتصغيره

- ( .رابط_مخفي )
بالرد على الرابط لاخفاء الرابط و جعله في مسافه معينة جرب الامر بنفسك

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'OPN':
		Home = [[Button.inline('( الكشف )',data='KshF'),Button.inline('( الروابط )',data='Link')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الكـشف و الروابط :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الكشف )
- ( .اوامر الروابط ) 

 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Name':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الاسم الوقتي :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .اسم وقتي )
بكتابة الامر لاضافة اسم وقتي حسب منطقة التي وضعتها .

- ( .انهاء اسم وقتي )
لانهاء الاسم الوقتي و ارجاع الاسم الطبيعي .

- ( .الصورة الوقتية )
 لوضع صورة تتغير مع الوقت

- ( .انهاء الصورة الوقتية )
 لأنهاء الصورة واسترجاع الصورة الاصلية
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Bio':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الكروب الوقتي :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .كروب وقتي )
بكتابة الامر لاضافة كروب وقتي حسب منطقة التي وضعتها .
- ( .انهاء كروب وقتي )
لانهاء الكروب الوقتي 
- ( .كروب صورة وقتي )
بكتابة الامر لتشغيل الصورة الوقتية للمجموعة حسب منطقة التي وضعتها .
- ( .انهاء كروب صورة وقتي )
 لأنهاء الصورة الوقتية للمجموعة.

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'GrTim':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الـخاص 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .الحماية تشغيل/تعطيل ) 
 لتشغيل امر الحمايه او تعطيله في الـخاص 

- ( .سماح ) 
 بالرد على الشخص للسماح له بالتكلم في الخاص

- ( .رفض ) 
 بالرد على الشخص لرفضه من الخاص 

- ( .المسموح لهم )
 فقط ارسل الامر لاظهار الاشخاص المسموح لهم والمرفوضين

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Tarh':
		buttons = [
    [
     Button.inline("( الترحيب )", data="Trh"),
     Button.inline("( الردود )", data="Reply")],[Button.inline('( القائمة الرئيسيه )',data='Home')]];await event.edit('''
قائمة اوامر الـترحيب والـردود :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الترحيب )
- ( .اوامر الردود )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=buttons)
	elif event.data == rb'Off':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شرح اوامر الاطفاء :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .اطفاء )
لالغاء تشغيل البوت و يجب اعادة تشغيله من هيروكو .

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Timer':
		Home = [[Button.inline('( الاسم )',data='Name'),Button.inline('( البايو )',data='Bio')],[Button.inline('الكروب الوقتي )',data='GrTim'),Button.inline('( الاطفاء )',data='Off')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الوقتي والتشغيل :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الاسم )
- ( .اوامر البايو )
- ( .اوامر الكروب الوقتي )
- ( .اوامر التشغيل ) 
- ( .اوامر الاطفاء ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'NextV':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر الفارات
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .وضع زخرفة الارقام )
- بالرد على الارقام المراد وضعها وكتابة الامر 
- ( .وضع اسم )
- بالرد على الاسم المراد وضعه وكتابة الامر
- ( .وضع كروب التخزين )
- بالرد على الايدي المحادثة المراد جعلها كروب التخزين 
- ( .وضع كروب الحفظ )
-بالرد على الايدي المحادثة المراد جعلها كروب الحفظ 
- ( .وقت العراق )
- لوضع الساعة بتوقيت العراق 
- ( .وقت السعودية )
 - لوضع الساعة بتوقيت السعودية 
- ( .وقت مصر )
 -لوضع الساعة بتوقيت مصر 
- ( .وقت الاردن )
- لوضع الساعة بتوقيت الاردن 
- ( .وقت اليمن )
- لوضع الساعة بتوقيت اليمن 
- ( .وقت سوريا )
- لوضع الساعة بتوقيت سوريا
- تنويه : عندما تريد حذف الفار استعمل الامر (محو) بدل كلمة (وضع)

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'VrAt':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home"),Button.inline('( التالي )',data='NextV')]];await event.edit('''
قائمة اوامر الفارات
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
᯽︙ اختر احدى هذه الاوامر

- ( .جلب + اسم الفار )
-لجلب قيمة الفار إن وجد
- ( .وضع توقيت )
-بالرد على المنطقة الزمنية 
- ( .وضع رمز الاسم )
- بالرد على الرمز المراد وضعه 
- ( .وضع الكروب )
- بالرد على اسم الكروب الذي تريد وضعهُ 
- ( .وضع البايو )
- بالرد على النبذا المراد وضعها 
 -( .وضع لون وقتي )
- بالرد على اسم اللون بالانجليزي 
- ( .وضع الصورة )
- بالرد على رابط تليجراف الصورة المراد وضعها وكتابة الامر 
- ( .وضع صورة الكروب )
- بالرد على رابط تليجراف الصورة المراد وضعها وكتابة الامر 

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Var':
		Home = [[Button.inline('( التخصيص )',data='JuSt'),Button.inline('( الفارات )',data='VrAt')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة التخصيص والفارات :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر التخصيص )
 لتغير الصور والكلايش كل من الحماية والفحص والبنك
- ( .اوامر الفارات )
 - لتغير الاسم وزخرفة الوقت والصورة الوقتية والمنطقة الزمنية ورمز الاسم والبايو الوقتي وغيرها
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'DelT':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر المسـح
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ اختر احدى هذه الاوامر

- ( .مسح  + بالرد على النص )
فقط اكتب الامر بالرد على الرسالة ليقوم بحذفها 

- ( .حذف رسائلي )
اكتب الامر في اي مكان وسيقوم بحذف جميع رسائلك في الدردشه حتى لو لم يكن لديك صلاحيات 

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'ClR':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر التنظيـف
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر

- ( .تنظيف + عدد الرسائل )
يقوم بحذف الرسائل اكتب الامر وعدد معين من الرسائل سيقوم بحذفها 

- ( .تنظيف  + الاضافة )
 يـجب وضع الشـارحه مع الاضافة (-)
مثـال  :  ( .تنظيف -ح )  <سيقوم بحذف المتحركات في الدردشة>
الاضافات : 
 (-ب) : لحـذف الرسائل الـصوتية
 (-م): لحـذف الملفات
 (-ح): لحـذف المتحـركه
 (-ص): لحـذف الـصور
 (-غ): لحـذف الاغاني
 (-ق): لحـذف الـملصقات
 (-ر): لحـذف الـروابط 
(-ف): لحـذف الفـيديوهـات

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Spam':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر السبـام
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ اختر احدى هذه الاوامر

- ( .سبام + كلمـة )
يقوم بتفصيخ احرف الكلمه وارسالها جربه بنفسك

- ( .وسبام + كلـمة )
كتابة الامر مع نص معين يقوم بتفصيخ الجمله كلمه كلمه وارسالها

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Agi':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر التـكرار

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ اختر احدى هذه الاوامر

- ( .كرر  +عدد التكرار  +بالرد على الرسالة )
 يقوم بتكرار النصوص والوسائط بالرد على الرسالة او الصورة 
مثال  :  ( بالرد على صورة  .كرر 10 )

- ( .تكرار الملصق + بالرد على ملصق )
 بالرد على الملصق ليقوم باستخراج جميع ملصقات الحزمه وارسالها

- (.مكرر  + وقت بالدقائق  + عدد  + بالرد )
 بالرد على نص او صورة او اي شي يقوم بالتكرار  مع وقت معين .
مثال  : بالـرد على نص ( .مكرر 10 2 )  عندها سترسل 10 رسائل نصية ( النص الي رديت عليه ) بفاصل ثانيتين بين كل رسالة

- ( .ضع تكرار + العدد )
لمنع التكرار بالمجموعة الخاصة بك بالعدد الذي وضعته للعودة للوضع الطبيعي ضع 999999.
مثال : ( .ضع تكرار 10 )

- ( .ايقاف التكرار` )
لأيقاف جميع التكرار ومن بينهم النشر التلقائي

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Clear':
		Home = [
    [
     Button.inline("( التكرار )", data="Agi"),Button.inline('( السبام )',data='Spam')],[Button.inline('( التنظيف )',data='ClR'),Button.inline('( المسح )',data='DelT')],[Button.inline('( القائمة الرئيسيه )',data='Home')]];await event.edit('''
قائمة اوامر التكرار والتنظيف :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر التكرار )
- ( .اوامر السبام )
- ( .اوامر التنظيف ) 
- ( .اوامر المسح ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'NOT':
		Home = [
    [
     Button.inline("( القفل )", data="Lock"),Button.inline('( الفتح )',data='OpeNed0')],[Button.inline('( المنع )',data='Not0')],[Button.inline('( القائمة الرئيسيه )',data='Home')]];await event.edit('''
قائمة اوامر القفل والمنع :
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر القفل )
- ( .اوامر الفتح )
- ( .اوامر المنع ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Lock':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر القـفـل 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .قفل + الاضافة ) 
 تكتب الامر مع الاضافة لقفل شي معين في المجموعة 

الاضافات  : 
 - الدردشه  : لقفل ارسال الرسائل 
- الوسائط   : لقفل ارسال الوسائط
 - الملصقات  : لقفل ارسال الملصقات
- الروابط  : لقفل ارسال الروابط
- المتحركه  : لقفل ارسال المتحركه
- الالعاب  : لقفل ارسال الالعاب الانلاين
- الانلاين  : لقفل ارسال البوتات الانلاين
- التصويت  : لقفل ارسال التوصيتات 
- الكل :  لقفل ارسال كل شي

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'OpeNed0':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الفـتـح 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .فتح + الاضافة ) 
 تكتب الامر مع الاضافة لفتـح شي معين في المجموعة 

الاضافات  : 
 - الدردشه  : لفتح ارسال الرسائل 
- الوسائط   : لفتح ارسال الوسائط
 - الملصقات  : لفتح ارسال الملصقات
- الروابط  : لفتح ارسال الروابط
- المتحركه  : لفتح ارسال المتحركه
- الالعاب  : لفتح ارسال الالعاب الانلاين
- الانلاين  : لفتح ارسال البوتات الانلاين
- التصويت  : لفتح ارسال التوصيتات 
- الكل :  لفتح ارسال كل شي

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
	elif event.data == rb'Not0':
		Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الـمنـع 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .منع + الكلمة ) 
 لمـنع الـكلمة في الـدردشة وسيتم حذفها عند ارسالها من اي شخص 

- ( .الغاء منع + الكلمة ) 
 لالغاء منع الكلمة والسماح للجميع بأرسالها في الدردشة

- ( .قائمة المنع ) 
لاظهـار قائمه الكـلمات الـتي منعـتها في الـدردشـه 

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Ntk")))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الـنطق 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .تكلم ar ) 
 بالرد على النص لتحويله الى مقطع صوتي للغة  يه 

- ( .تكلم en ) 
 بالرد على النص لتحوليه الى مقطع صوتي للغه الانكليزية

- ( .احجي ar ) 
 بالرد على مقطع صوتي او بصمة لتحوليه الى نص للغه  ية

- ( .احجي en ) 
 بالرد على مقطع صوتي او بصمة لتحوليه الى نص للغه الانكليزية

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Do2")))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن امـر التحمـيل
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر

- (.بحث + اسم الاغنية)
بكتابة اسم الاغنية مع الامر لارسال الاغنيه مباشرا واذا ما اشتغل جرب اوامر التحميل الاخرى
- مثـال : .بحث ماهر زين

- (.يوت + اسم الفيديو او الاغنية)
كتابة الامر مع اسم الفيديو او الاغنية ليعطيك نتائج البحث وروابط من يوتيوب تستخدم مع اوامر التحميل
- مثـال : .يوت ماهر زين

- (.تحميل ص + رابط الاغنية)
لتحميل اغنيه من خلال وضع الرابط مع الامر
- مثـال : .تحميل ص https://youtube.com/...

- (.فيديو + اسم الاغنية)
كتابة الامر مع اسم المقطع لتحميله وارساله
- مثـال : .فيديو باسم الكربلائي

- (.انستا + الرابط )
يستخدم هذا الامر لتحميل من الانستا فقط اكتب الامر مع رابط الفيديو ليحمله
- مثـال : .انستا https://instagram.com/jdisjejjd...

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Trans")))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الترجمة 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .ترجمة ar ) 

 بالرد على النص لترجمته للغه  ية

- ( .ترجمة en ) 
 بالرد على النص لترجمته للغه الانكليزية

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)



@bot.on(admin_cmd(outgoing=True, pattern="اوامري"))
async def repo(event):
    if event.fwd_from:
        return
    lMl10l = Config.TG_BOT_USERNAME
    if event.reply_to_msg_id:
        await event.get_reply_message()
    response = await bot.inline_query(lMl10l, "اوامري")
    await response[0].click(event.chat_id)
    await event.delete()

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Home")))
@check_owner
async def _(event):
	Home = [
                [Button.inline("( اوامر الادمن  ) ① ", data="Admin")],
                
                    [Button.inline("( المجموعات ) ②", data="Groups"),
                    Button.inline("( الترحيب .. ) ③", data="Tarh"),
                    Button.inline("( الحمايه .. ) ④", data="Securty")],
                    
                    [Button.inline("( الانتحال والتقليد ) ⑤", data="TargetU")],[Button.inline("( التحميل ..) ⑥", data="DOO")],
                    
                [Button.inline("( المنع .. ) ⑦", data="NOT"),
                    Button.inline("( التنظيف .. ) ⑧", data="Clear")],
                    [Button.inline("( الفارات ) ⑨", data="Var")],
                [Button.inline("( الوقتي ..) ⓪①", data="Timer"),
                    Button.inline("( الكشف و ..) ①① )", data="OPN")],
                [Button.inline("( المساعده ) ②① ", data="Helper")],
              [Button.inline("( أذكار .. ) ③①", data="Think"),
                    Button.inline("( الملصقات ) ④①", data="Sticker")],
                [Button.inline("( التسليه ميمز ) ⑤①", data="FunY")],
                [
                    Button.inline("( الصيغ ..) ⑥①", data="Contect"),
                    Button.inline(" ( التمبلر ..) ⑦①", data="Tumbler")],[Button.inline("(  الحساب ) ⑧①", data="Account")]
                    ,[Button.inline("( ميوزك ) ⑨①", data="Music"),Button.inline("( بصمات ) ⓪②", data="Voice")],[Button.inline("( التجميع ) ②①", data="Colect")]
                    ,[Button.url("( اوامر البوت )", url="JEPTHON.t.me")]
            ]
	await event.edit(ROE, buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Telegraph')))
@check_owner
async def _(event):
	Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر التلكراف 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .تلكراف ميديا ) 

 لاستخراج رابط من الصورة على شكل رابط تلكراف  

- ( .تلكراف نص ) 
 بالرد على النص او المقالة لصنع رابط تلكراف للنص

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Sec1")))
@check_owner
async def _(event):
	Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الـخاص 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .الحماية تشغيل/تعطيل ) 
 لتشغيل امر الحمايه او تعطيله في الـخاص 

- ( .سماح ) 
 بالرد على الشخص للسماح له بالتكلم في الخاص

- ( .رفض ) 
 بالرد على الشخص لرفضه من الخاص 

- ( .المسموح لهم )
 فقط ارسل الامر لاظهار الاشخاص المسموح لهم والمرفوضين

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Securty")))
@check_owner
async def _(event):
	Home = [[Button.inline('( الحماية )',data='Sec1'),Button.inline('( التلكراف )',data='Telegraph')],
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
قائمة اوامر حـماية الخاص والتلكراف :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الحماية )
- ( .اوامر التلكراف ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Admin")))
@check_owner
async def _(event):
    buttons = [
    [Button.inline("( الحظر )",data='Block'),Button.inline('( الكتم )',data='Mute')],[Button.inline('( التثبيت )',data='Pin'),Button.inline('( الاشراف )',data='Admins')],
      [Button.inline("( القائمة الرئيسيه )", data="Home")]
      ]
    await event.edit('''
قائمة اوامر الادمن لسورس الجوكر :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( `.اوامر الحظر` )
- ( `.اوامر الكتم` )
- ( `.اوامر التثبيت` )
- ( `.اوامر الاشراف` )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=buttons)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Block')))
@check_owner
async def _(event):
    butze = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]]
    await event.edit('''
 شـرح عـن اوامـر الحـظر 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

( .حظر ) 
-  تقوم بالرد على شخص او وضع معرفه مع الامر وسيحظره من المجموعة

( .الغاء حظر )
 - بالرد على الشخص او كتابة معرفه مع الامر لالغاء حظره
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
 ''', buttons=butze)


@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Mute')))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]]
    await event.edit('''
شـرح عـن اوامـر الكـتم 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

( .كتم ) 
-  تقوم بالرد على شخص او وضع معرفه مع الامر وسيكتمه من المجموعة

( .الغاء كتم )
 - بالرد على الشخص او كتابة معرفه مع الامر لالغاء كتمه

( .كتم_مؤقت+عدد الساعات او الدقائق+السبب )
 - بالرد على الشخص او كتابة معرفه مع الامر لتقيدة من المجموعة مؤقتا
مثال : كتم_مؤقت 1h مخالف القوانين
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'DOO')))
@check_owner
async def _(event):
	Home = [
    [
     Button.inline("( النطق )", data="Ntk"),Button.inline('( التحميل )',data='Do2')]
     ,[Button.inline('( الترجمة )',data='Trans')],[Button.inline('( القائمة الرئيسيه )',data='Home')]];await event.edit('''
قائمة اوامر التحميل والترجمه :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر النطق )
- ( .اوامر التحميل )
- ( .اوامر الترجمة ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)
@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Admins')))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]]
    await event.edit('''
شـرح عـن اوامـر الاشراف 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

( .رفع مشرف ) 
-  تقوم بالرد على الشخص مع الامر و سيرفع مشرفا في المجموعة

( .تك )
 - بالرد على الشخص مع الامر لإنزاله من الاشراف في المجموعة

( .ارفع ) 
- لرفع المستخدم في جميع المجموعات مع كافة الصلاحيات مع لقب مخفي

( .نزل ) 
-لتنزيل الشخص من رتبة الاشراف في جميع المجموعات
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★➖
⌔︙CH : @VEEVVW
    ''', buttons=Home)


@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Pin')))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]]
    await event.edit('''
شـرح عـن اوامـر التثبيت 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

( .تثبيت ) 
-  تقوم بالرد على الرسالة مع الامر وستثبت في المجموعة

( .الغاء التثبيت )
 - بالرد على الرسالة مع الامر لإلغاء تثبيتها
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Group2")))
@check_owner
async def _(event):
	Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الكروب 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .الاحداث ) 
 كتابة  الامـر في الكروب لعرض احداث الكروب

- ( .الاعضاء ) 
 فقـط ارسل الامر في المجموعة لعرض اعضاء المجموعة

- ( .المشرفين ) 
 ارسل الامر في المجموعه لعرض حسابات المشرفين

- ( .البوتات )
 ارسل الامر في المجموعه لعرض البوتات

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Groups')))
@check_owner
async def _(event):
    Gr = [
    [
     Button.inline("( التفليش )", data="Bom"),
     Button.inline("( المحذوفين )", data="Deleted")],[Button.inline("( الكروب )",data='Group2')],[Button.inline("( القائمة الرئيسيه )",data='Home')]]
    await event.edit('''
قائمة اوامر المجـموعه لسورس الجوكر :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر التفليش )
- ( .اوامر المحذوفين )
- ( .اوامر الكروب )
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=Gr)
     
@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Deleted')))
async def _(event):
	Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر المـحذوفين 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .حذف المحظورين ) 
 كتابة  الامـر في الكروب لالغاء حظر جميع الاعضاء 

- ( .اطردني ) 
 فقـط ارسل الامر في المجموعة لمغادرة المجموعه التي تم ارسال الامر فيها

- ( .المحذوفين ) 
 لعرض الحسابات المحذوفة في مجمـوعة معيـنة ولحذفهم ارسل .المحذوفين اطردهم

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'Bom')))
async def _(event):
	Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر التفليـش 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .تفليش بالطرد ) 
 ارسل  الامـر لطرد جميع الاعضاء من المجموعه 

- ( .تفليش ) 
 كتابة  الامـر فقط في المجموعه لحظر جميع الاعضاء

- ( .حظر_الكل ) 
 كتابة  الامـر فقط في المجموعه لحظر جميع الاعضاء بدون صلاحيات عن طريق بوت الحماية 

- ( .طرد_الكل ) 
 كتابة  الامـر فقط في المجموعه ليقوم بطرد جميع الاعضا بدون صلاحيات عن طريق بوت الحماية 

- ( .كتم_الكل ) 
 كتابة  الامـر فقط في المجموعه ليقوم بكتم جميع الاعضاء بدون صلاحيات اشراف عن طريق بوت الحماية

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Trh")))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]]
    await event.edit('''
شـرح عـن اوامـر الترحيب 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

--( .ترحيب + ترحيبك )
 اكتب الامر مع ترحيب في المجموعه ليرحب بالاعضاء الجدد

- ( .حذف الترحيب ) 
 فقـط ارسل الامر في المجموعة لحذف الترحيبات

- ( .الترحيب )
 ارسل الامر في المجموعه لعرض ترحيبات المجموعة

- ( .الترحيب السابق ايقاف/تشغيل )
 لتعطيل اخر ترحيب وضعته في المجموعة او تشغيل

- ( .رحب + ترحيبك )
 لوضع ترحيب في عند دخول الاعضاء للمجموعة سوف يرحب بهم في الخاص

- ( .حذف رحب )
 لحذف الترحيب في الخاص
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)


@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"Reply")))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]]
    await event.edit('''
شـرح عـن اوامـر الـردود 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .رد + ردك ) 

 لوضع رد معين في المجموعة اكتب الامر وردك

- ( .حذف الردود ) 
 فقـط ارسل الامر في المجموعة لحذف الردود المضافة

- ( .الردود ) 
 ارسل الامر في المجموعه لعرض ردود المجموعة

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''',buttons=Home)


@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"TargetU")))
@check_owner
async def _(event):
    buttons = [
    [
     Button.inline("( الانتحال )", data="TarU"),
     Button.inline("( التقليد )", data="LikU")],[Button.inline('( المنشن )',data='mention')],[Button.inline('( القائمة الرئيسة )',data='Home')]]
    
    await event.edit('''
قائمة اوامر الـمنشن والانتحال :
 ★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه القوائم

- ( .اوامر الانتحال )
- ( .اوامر التقليد )
- ( .اوامر المنشن ) 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
⌔︙CH : @VEEVVW
''', buttons=buttons)


@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"TarU")))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الانتحال 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .انتحال ) 

 بالرد على الشخص لنسخ حسابه بالكامل من صورة واسم وبايو  

- ( .اعادة ) 
 لارجاع الحساب الى وضعه الطبيعي لما كان سابقا

- ( .انتحال_الدردشه ) 
 قم بكتابة الامر مع معرف المجموعة او القناة بدون @

- ( .اعادة_الدردشه ) 
 لارجاع الدردشه الى وضعه الطبيعي لما كان سابقا

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb"LikU")))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الـتقليـد 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- ( .تقليد ) 
 بالرد على الشخص لتقليد جميع رسائله في الدردشه 

- ( .الغاء التقليد ) 
 بالرد على الشخص لايقاف التقليد

- ( .المقلدهم ) 
لاظهـار قائمه الاشخاص الذي فعـلت عليهم امر التقليد ولمسحهم ارسل  (.مسح المقلدهم) 

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)

@l313l.tgbot.on(CallbackQuery(data=re.compile(rb'mention')))
@check_owner
async def _(event):
    Home = [
    [
     Button.inline("( القائمة الرئيسية )", data="Home")]];await event.edit('''
شـرح عـن اوامـر الـمنشن 
★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
 ᯽︙ اختر احدى هذه الاوامر 

- (.منشن + المسج)
قم بكتابة الامر في المجموعة لعمل تاك مفرد للاعظاء الموجودين
- (.الغاء منشن)
لألغاء التاك 

★•┉ ┉ ┉ ┉ ┉ ┉  ┉ ┉ ┉ ┉•★
᯽︙ CH : @VEEVVW
''', buttons=Home)
